[
  {
    "id": "",
    "name": "Angel Cajalne",
    "content": "Angel Cajalne\n\nSummary: Provided coaching for trainees and monitored their check-ins and surprise activity, graded Day 2 materials, and checked break notification process.\n\n- Rocky and Diana were coached on improving their communication and attentiveness, and made a commitment to their action plan. <<RED_FLAG>> Rocky, Cha, and Chai missed their surprise activity, but were coached to be more attentive and ensure they don't miss it again.\n- All trainees passed Day 2 training with good grades and no retakes are needed. \n- Wednesday's to-do includes monitoring trainees' check-ins and attentiveness, sending the surprise activity, and grading Day 3 training activities.\n\n<<RED_FLAG>> Action may be necessary to address the repeated issue of Rocky, Cha, and Chai missing surprise activities. It is recommended for the manager to speak with them and discuss ways to improve their attention to notifications and timing.",
    "created_at": "2023-06-08T18:56:21.804634"
  },
  {
    "id": "",
    "name": "Shannen Jaucian",
    "content": "Shannen Jaucian\n\nOverall, the state of the employee seems to be good and there are no immediate manager actions needed. However, there are a couple of areas that might need attention:\n- Unpaid invoice for Monitor Advance from HOMESMART\n- Pending client contract with HUMPHREYS <<RED_FLAG>>\n- Some no-shows and rescheduling of VEs visits\n\nIt might be helpful for the manager to check-in on the HUMPHREYS pending client contract to ensure that it is moving forward. Additionally, following up with the VEs who missed their appointments could help with scheduling and improving communication.",
    "created_at": "2023-06-08T18:56:32.035533"
  },
  {
    "id": "",
    "name": "Pamela Cruz",
    "content": "Pamela Cruz\n\nPamela had a great, busy day, rating it 5/5. <<NO_ACTION_NEEDED>>\n\n- Took care of emails, contracts, bonuses, new orders, and client interviews successfully.\n- No pending items for today.\n- <<NO_ACTION_NEEDED>>",
    "created_at": "2023-06-08T18:56:37.783824"
  },
  {
    "id": "",
    "name": "Alex Plant",
    "content": "Alex Plant\n\nOverall, Alex had a productive day and accomplished several tasks. However, there are no specific issues or areas that need managerial intervention.\n\n- Reviewed and repurposed multiple image and video assets.\n- Produced job opportunity assets and cleaned up social media inquiries.\n- Uploaded files to Google Drive.\n\nNo {{RED_FLAG}}red flags{{END_RED_FLAG}} this time. Good job, Alex!",
    "created_at": "2023-06-08T18:56:50.022417"
  }
]